-- --------------------------------------------------------
-- Host:                         127.0.0.1
-- Server version:               5.6.21 - MySQL Community Server (GPL)
-- Server OS:                    Win32
-- HeidiSQL version:             7.0.0.4053
-- Date/time:                    2015-08-14 16:50:40
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET FOREIGN_KEY_CHECKS=0 */;

-- Dumping structure for table intita.lecture_page
DROP TABLE IF EXISTS `lecture_page`;
CREATE TABLE IF NOT EXISTS `lecture_page` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `id_lecture` int(10) NOT NULL,
  `page_title` varchar(255) DEFAULT NULL,
  `page_order` int(10) DEFAULT NULL,
  `video` int(10) DEFAULT NULL,
  `quiz` int(10) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=103 DEFAULT CHARSET=utf8;

-- Dumping data for table intita.lecture_page: ~97 rows (approximately)
/*!40000 ALTER TABLE `lecture_page` DISABLE KEYS */;
INSERT INTO `lecture_page` (`id`, `id_lecture`, `page_title`, `page_order`, `video`, `quiz`) VALUES
	(1, 117, 'Що таке програмування?', 1, 340, 393),
	(2, 117, 'Що потрібно щоб стати програмістом', 2, 341, 394),
	(3, 117, 'Що таке мова програмування', 3, 395, NULL),
	(4, 117, 'Якою має бути програма?', 4, 396, 397),
	(5, 117, 'Етапи програмування', 5, 398, 400),
	(6, 118, NULL, 1, 449, 454),
	(7, 118, NULL, 2, 450, 455),
	(8, 118, NULL, 3, 451, 456),
	(9, 118, NULL, 4, 452, 457),
	(10, 118, NULL, 5, 453, 458),
	(11, 118, NULL, 6, 462, 459),
	(12, 118, NULL, 7, 472, 461),
	(13, 127, NULL, 1, NULL, 728),
	(14, 127, NULL, 2, NULL, 732),
	(15, 127, NULL, 3, NULL, 736),
	(16, 127, NULL, 4, NULL, 739),
	(17, 127, NULL, 5, NULL, 743),
	(18, 127, NULL, 6, NULL, 747),
	(19, 127, NULL, 7, NULL, 750),
	(20, 131, NULL, 1, NULL, 754),
	(21, 131, NULL, 2, NULL, 757),
	(22, 131, NULL, 3, NULL, 760),
	(23, 131, NULL, 4, NULL, 765),
	(24, 131, NULL, 5, NULL, 769),
	(25, 131, NULL, 6, NULL, 773),
	(26, 131, NULL, 7, NULL, 776),
	(27, 131, NULL, 8, NULL, 780),
	(28, 131, NULL, 9, NULL, 783),
	(29, 131, NULL, 10, NULL, NULL),
	(30, 129, 'Принципи фон Неймана.', 1, NULL, 789),
	(31, 129, 'Як працює машина фон Неймана', 2, NULL, 792),
	(32, 129, 'Недоліки принципів фон Неймана', 3, NULL, 795),
	(33, 129, 'Гарвардська архітектура комп’ютера', 4, NULL, 799),
	(34, 129, 'Модифікації гарвардської архітектури', 5, NULL, 802),
	(35, 129, 'Що таке процесор, його будова', 6, NULL, 806),
	(36, 129, 'Складові процесора. Робота процесора', 7, NULL, 809),
	(37, 129, 'Основні технічні характеристики процесора', 8, NULL, 812),
	(39, 130, 'Що таке операційна система.', 1, NULL, 815),
	(40, 130, 'Функції операційної системи.', 2, NULL, 818),
	(41, 130, 'Історія створення операційних систем.', 3, NULL, 822),
	(42, 130, 'Сьогодення операційних систем.', 4, NULL, 825),
	(43, 130, 'Складові операційних систем', 5, NULL, 828),
	(47, 132, 'Що таке алгоритм.', 1, NULL, 877),
	(48, 132, 'Ознаки алгоритму.', 2, NULL, 880),
	(49, 132, 'Словесний спосіб запису алгоритму.', 3, NULL, 884),
	(50, 132, 'Запис алгоритму у вигляді таблиць, формул, схем, малюнків.', 4, NULL, NULL),
	(51, 132, 'Запис алгоритму у вигляді </strong><strong>блок-схеми', 5, NULL, NULL),
	(52, 132, 'Запис алгоритму у вигляді </strong><strong>алгоритмічної пови (псевдокоду)</strong>', 6, NULL, NULL),
	(53, 132, 'Запис алгоритму на мові програмування.', 7, NULL, NULL),
	(54, 133, 'Що таке система числення', 1, NULL, 857),
	(55, 133, 'Непозиційна система числення, змішана система числення.', 2, NULL, 860),
	(56, 133, 'Переведення цілого числа з десяткової системи числення.', 3, NULL, NULL),
	(57, 133, '', 4, NULL, 867),
	(58, 133, ' Переведення з будь-якої позиційної системи числення у десяткову.', 5, NULL, 873),
	(59, 133, NULL, 6, NULL, 874),
	(60, 125, 'Що таке технологія програмування.', 1, NULL, 899),
	(61, 125, 'Процедурне програмування.', 2, NULL, 902),
	(62, 125, 'Деякі поняття структурного програмування. Модульне програмування.', 3, NULL, 905),
	(63, 125, 'Деякі поняття структурного програмування. Низхідне програмування.', 4, NULL, 917),
	(64, 125, 'Деякі поняття структурного програмування. Висхідне програмування.', 5, NULL, 918),
	(65, 125, 'Структурне програмування.', 6, NULL, 919),
	(66, 125, 'Об’єктно-орієнтоване програмування.', 7, NULL, 920),
	(67, 125, 'Основні поняття об’єктно-орієнтованого програмування.', 8, NULL, 921),
	(68, 126, 'Що таке мова програмування', 1, NULL, 924),
	(69, 126, 'Історія мов програмування. Машина мова програмування.', 2, NULL, 928),
	(70, 126, 'Історія мов програмування. Мова асемблера. ', 3, NULL, 932),
	(71, 126, 'Історія мов програмування. Мови високого рівня.', 4, NULL, 936),
	(72, 126, 'Історія мов програмування. Структурне програмування.', 5, NULL, 939),
	(73, 126, 'Історія мов програмування. Об’єктно-орієнтоване програмування.', 6, NULL, 942),
	(74, 126, 'Застосування сучасних мов програмування.', 7, NULL, 945),
	(75, 126, 'Середовища програмування.', 8, NULL, 948),
	(76, 126, 'Стандартизація мов програмування.', 9, NULL, 951),
	(77, 126, 'Виключення можливостей мови, які визнані застарівшими.', 10, NULL, 954),
	(79, 111, NULL, 1, NULL, NULL),
	(80, 110, NULL, 1, NULL, NULL),
	(81, 109, NULL, 1, NULL, NULL),
	(82, 108, NULL, 1, NULL, NULL),
	(83, 107, NULL, 1, NULL, NULL),
	(84, 106, NULL, 1, NULL, NULL),
	(85, 105, NULL, 1, NULL, NULL),
	(86, 104, NULL, 1, NULL, NULL),
	(87, 103, NULL, 1, NULL, NULL),
	(88, 102, NULL, 1, NULL, NULL),
	(89, 101, 'Вступ', 1, NULL, NULL),
	(90, 101, 'Частина 1. Типи даних', 2, NULL, NULL),
	(91, 101, 'Частина 2. Змінні', 3, NULL, NULL),
	(92, 101, 'Частина 3. Операції і вирази', 4, NULL, NULL),
	(93, 101, 'Частина 4. Пріоритети операцій', 5, NULL, NULL),
	(94, 101, 'Частина 5. Оператори введення-виведення', 6, NULL, NULL),
	(95, 101, 'Частина 6. Оператор переходу', 7, NULL, NULL),
	(96, 195, NULL, 1, NULL, NULL),
	(97, 195, NULL, 6, NULL, NULL),
	(98, 195, NULL, 5, NULL, NULL),
	(99, 195, NULL, 4, NULL, NULL),
	(100, 195, NULL, 2, NULL, NULL),
	(101, 195, NULL, 3, NULL, NULL),
	(102, 117, NULL, 6, NULL, NULL);
/*!40000 ALTER TABLE `lecture_page` ENABLE KEYS */;
/*!40014 SET FOREIGN_KEY_CHECKS=1 */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
