<div class="spoiler-title closed">Розкрити відгук про навчання &#9660;</div>
<div class="spoiler-body">
    <?php echo "Сегодня меня уже в третий раз расспрашивали о том,
как проходило мое обучение на Android-разработчика. Интересовались как проходило обучение,
условиями, доволен ли процессом, результатами, преподавателями и тому подобное. Решил написать
статейку в блог (нужно же в него что-то писать периодически). О том, как проходило обучение
плюсы и минусы в нем, читайте далее. Попал в самый первый набор годичных курсов по Android разработке.
 Т.е. я был в группе, которая первая прошла этот курс. Вполне реально, что сейчас администрация как-то
 откорректировала программу учитывая свой “первый опыт”. Хотя, что касается программы, как по мне, все было
 вполне грамотно и я не думаю,
 что она будет как-то существенно изменена, если вообще будет как-то корректироваться. "?>
</div>
